import time
import random


def delay_print(s):
    for c in s:
        print(c, end="")
        time.sleep(random.random() * 0.01)
    print()


character_name = input("Вітаю! Введіть ім'я вашого персонажа: ")
delay_print(
    "Вітаю, "
    + character_name
    + "! Тобі належить вибрати свій шлях у невеликій грі, в результаті якої ти дізнаєшся який сік компанії Січко™ тобі підходить найбільше!"
)

answers_array = []

quest_index = 0

delay_print(
    "Вітаю на першому рівні! До тебе підходить невідоме створіння, схоже на гнома, і каже:\n'Привіт, незнайомцю. Якщо ти хочеш пройти, то тобі потрібно відгадати загадку. Якщо ти не хочеш, то я тебе вб'ю.'"
)

print(
    "Варіанти відповідей:\n1) 'Так, я хочу відгадати загадку.'\n2) 'Ні, я не хочу відгадувати загадку. (почати пізділовку)'"
)

answer = input("Введіть відповідь: ")
answers_array.append(answer)

match answer:
    case "1":
        delay_print(
            "Гном: 'Добре, тоді почнемо. Якщо ти відгадаєш, то я тобі дам піти.'"
        )
    case "2":
        delay_print("Гном: 'Ти вирішив битися? Тоді почнемо.'")
    case _:
        delay_print(
            "Гном: 'Я не розумію тебе. Якщо ти не зможеш відповісти, то я тебе вб'ю.'"
        )


quest_index = 1
previous_answer = answers_array[quest_index - 1]

quest_answer = 0
next_answer = 0

match previous_answer:
    case "1":
        delay_print(
            "Гном: 'У мами Івана було три сини. Першого звали Петро, другого – Василь. Як звали третього сина?'"
        )
        print("Варіанти відповідей:\n1) 'Іван'\n2) 'Петро'\n3) 'Василь'")
        quest_answer = input("Введіть відповідь: ")
        answer = 1
    case "2":
        print("*Гном розмахується кулаком і ударяє вас по коліну.*")
        delay_print("Гном: 'Н-Н-Н-А-А-А!!!'")
        print(
            "*Ви відчуваєте сильний біль в коліні але він не надто сильний*\n1. *пнути гнома з усієї сили ногою*\n2. Будь ласка!!! Не бий! Я відповім на твою загадку!!!"
        )
        next_answer = "2"
        answer = input("Введіть відповідь: ")
    case _:
        delay_print("Гном: 'Шо ти там бормочеш??!!'")

quest_index = 2
answers_array.append(answer)
previous_answer_2 = answers_array[quest_index - 1]

print(previous_answer_2)
print(quest_answer)

match previous_answer_2:
    case "1":
        if quest_answer == "1":
            delay_print(
            "Гном: 'Ти красавец, єжі!"
            )
            quest_answer = input("Введіть відповідь на комплімент: ")
        else:
            delay_print(
            "Гном: 'Ти даун, неправильно!"
            )
            answer = input("Введіть відповідь на глузування: ")
            
    case "2":
        print("*Гном розмахується кулаком і ударяє вас по коліну.*")
        delay_print("Гном: 'Н-Н-Н-А-А-А!!!'")
        print(
            "*Ви відчуваєте сильний біль в коліні але він не надто сильний*\n1. *пнути гнома з усієї сили ногою*\n2. Будь ласка!!! Не бий! Я дам тобі піздлюей!!!"
        )
        answer = input("Введіть відповідь: ")
        delay_print("Пізда тобі мразота!")
        print("Ви пізданули гнома зі всієї сили ногою і в нього скрутився м'яз на ляшці.")
        print('Гном корчитсья від болі, а ви смієітеесь')
        delay_print("ХА-ХА-ХА-ХА-ХА ЛЕГЧАЙШАЯ ДЛЯ КОГО ДЛЯ ВЕЛИЧАЙШЕГО")
    case _:
        delay_print("Гном: 'Шо ти там бормочеш чмо??!!'")
